Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t
Serialization structure for shape Enumerator data

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.ShapeName
Shape names.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.ShapeGuid
Shape GUID.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.GeometryGuid
Shape geometry GUID.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.Fingerprint
Shape geometry fingerprint.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.Extrema
Shape extrema.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.Solidity
Shape solidity.

Tekla.Structures.CatalogInternal.dotcatShapeEnumData_t.BrepType
Shape brep type.